//
//  Json.swift
//  taskDiaryApp
//
//  Created by Rodianov on 2/12/22.
//

import Foundation

let json = """
{
  "items": [{
      "id": 1,
      "date_start": 1644685200,
      "date_finish": 1644688800,
      "name": "My task 1",
      "description": "Описание моего дела парлв плрдв ыволап мсыиарв итплавл имлывим"
    },
    {
      "id": 2,
      "date_start": 1644667200,
      "date_finish": 1644670800,
      "name": "My task 2",
      "description": "Описание моего дела парлв плрдв ыволап мсыиарв итплавл имлывим"
    },
    {
      "id": 3,
      "date_start": 1644656400,
      "date_finish": 1644663600,
      "name": "My task 3",
      "description": "Описание моего дела 12134 и 3563546 р 45647 л6 56 ьнрило65н 46 нлр4н"
    },
    {
      "id": 4,
      "date_start": 1644750000,
      "date_finish": 1644757200,
      "name": "My task 4",
      "description": "Описание моего дела 12134 и 3563546 р 45647 л6 56 ьнрило65н 46 нлр4н"
    },
    {
      "id": 5,
      "date_start": 1644854400,
      "date_finish": 1644861600,
      "name": "My task 5",
      "description": "Описание моего дела 12134 и 3563546 р 45647 л6 56 ьнрило65н 46 нлр4н"
    },
    {
      "id": 6,
      "date_start": 1645199154,
      "date_finish": 1645201854,
      "name": "My task 6",
      "description": "Описание моего дела 12134 и 3563546 р 45647 л6 56 ьнрило65н 46 нлр4н"
    },
    {
      "id": 7,
      "date_start": 1643772774,
      "date_finish": 1643784474,
      "name": "My task 7",
      "description": "Описание моего дела 12134 и 3563546 р 45647 л6 56 ьнрило65н 46 нлр4н"
    },
    {
      "id": 8,
      "date_start": 1641698154,
      "date_finish": 1641701754,
      "name": "My task 8",
      "description": "Описание моего дела 12134 и 3563546 р 45647 л6 56 ьнрило65н 46 нлр4н"
    },
    {
      "id": 9,
      "date_start": 1642914954,
      "date_finish": 1642918614,
      "name": "My task 9",
      "description": "Описание моего дела 12134 и 3563546 р 45647 л6 56 ьнрило65н 46 нлр4н"
    },
    {
      "id": 10,
      "date_start": 1645166400,
      "date_finish": 1645167600,
      "name": "My task 10",
      "description": "Описание моего дела 12134 и 3563546 р 45647 л6 56 ьнрило65н 46 нлр4н"
    },
    {
      "id": 11,
      "date_start": 1644864900,
      "date_finish": 1644865920,
      "name": "My task 11",
      "description": "Описание моего дела 12134 и 3563546 р 45647 л6 56 ьнрило65н 46 нлр4н"
    }
  ]
}
"""

// 1 = 12.02  20-21
// 2 = 12.02  15-16
// 3 = 12.02  12-14
// 4 = 13.02  14-16
// 5 = 14.02  19-21
// 6 = 18.02  18:45 - 19:30
// 7 = 2.02   06:32 - 9:47
// 8 = 9.01   06:15 - 7:15
// 9 = 23.01  8:15  - 9: 16
// 10 = 18.02 9:40  - 10:00
// 11 = 14.02 21:55 - 22:12
